Revit 2027 API
MEPSystemType.FillColor Property
 Indicates the color that should override the fill color for all components in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color FillColor { get; set; }
Public Property FillColor As Color
	Get
	Set
public:
property Color^ FillColor {
	Color^ get ();
	void set (Color^ value);
}
member FillColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace